public/man/man1/git-shortlog.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>
        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - git-shortlog.1 | Technical Notes</title>

      <link rel="stylesheet" href="/css/main.min.a9ecaac9d4f7845fc2de4738f7709cab0bd1c3d19c3466fadd637a6987603257.css" integrity="sha256-qeyqydT3hF/C3kc493CcqwvRw9GcNGb63WN6aYdgMlc=" crossorigin="anonymous">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - git-shortlog.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>git-shortlog - Summarize git log output</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<pre class="example">
git shortlog [&lt;options&gt;] [&lt;revision-range&gt;] [[--] &lt;path&gt;...]
git log --pretty=short | git shortlog [&lt;options&gt;]
</pre>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>Summarizes <em>git log</em> output in a format suitable for inclusion in
release announcements. Each commit will be grouped by author and title.</p>
<p>
Additionally, &#34;[PATCH]&#34; will be stripped from the commit description.</p>
<p>
If no revisions are passed on the command line and either standard input
is not a terminal or there is no current branch, <em>git shortlog</em> will
output a summary of the log read from standard input, without reference
to the current repository.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
OPTIONS
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p>-n, –numbered</p>
<blockquote>
<p>Sort output according to the number of commits per author instead of
author alphabetic order.</p>
</blockquote>
<p>
-s, –summary</p>
<blockquote>
<p>Suppress commit description and provide a commit count summary only.</p>
</blockquote>
<p>
-e, –email</p>
<blockquote>
<p>Show the email address of each author.</p>
</blockquote>
<p>
–format[=&lt;format&gt;]</p>
<blockquote>
<p>Instead of the commit subject, use some other information to describe
each commit. <em>&lt;format&gt;</em> can be any string accepted by the <strong>–format</strong>
option of <em>git log</em>, such as <em>* [%h] %s</em>. (See the &#34;PRETTY FORMATS&#34;
section of *git-log*(1).)</p>
<blockquote>
<pre class="example">
Each pretty-printed commit will be rewrapped before it is shown.
</pre>
</blockquote>
</blockquote>
<p>
–date=&lt;format&gt;</p>
<blockquote>
<p>Show dates formatted according to the given date string. (See the
<strong>–date</strong> option in the &#34;Commit Formatting&#34; section of <strong>git-log*(1)).
Useful with *–group=format:&lt;format&gt;</strong>.</p>
</blockquote>
<p>
–group=&lt;type&gt;</p>
<blockquote>
<p>Group commits based on <strong>&lt;type&gt;</strong>. If no <strong>–group</strong> option is specified,
the default is <strong>author</strong>. <strong>&lt;type&gt;</strong> is one of:</p>
<blockquote>
<p>·</p>
<p>
<strong>author</strong>, commits are grouped by author</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
<strong>committer</strong>, commits are grouped by committer (the same as <strong>-c</strong>)</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
<strong>trailer:&lt;field&gt;</strong>, the <strong>&lt;field&gt;</strong> is interpreted as a case-insensitive
commit message trailer (see <strong>git-interpret-trailers*(1)). For example,
if your project uses *Reviewed-by</strong> trailers, you might want to see who
has been reviewing with <strong>git shortlog -ns –group=trailer:reviewed-by</strong>.</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
<strong>format:&lt;format&gt;</strong>, any string accepted by the <strong>–format</strong> option of <em>git
log</em>. (See the &#34;PRETTY FORMATS&#34; section of *git-log*(1).)</p>
<p>
Note that commits that do not include the trailer will not be counted.
Likewise, commits with multiple trailers (e.g., multiple signoffs) may
be counted more than once (but only once per unique trailer value in
that commit).</p>
<p>
Shortlog will attempt to parse each trailer value as a <strong>name &lt;email&gt;</strong>
identity. If successful, the mailmap is applied and the email is omitted
unless the <strong>–email</strong> option is specified. If the value cannot be parsed
as an identity, it will be taken literally and completely.</p>
</blockquote>
<p>
If <strong>–group</strong> is specified multiple times, commits are counted under each
value (but again, only once per unique value in that commit). For
example, <strong>git shortlog –group=author –group=trailer:co-authored-by</strong>
counts both authors and co-authors.</p>
</blockquote>
<p>
-c, –committer</p>
<blockquote>
<p>This is an alias for <strong>–group=committer</strong>.</p>
</blockquote>
<p>
-w[&lt;width&gt;[,&lt;indent1&gt;[,&lt;indent2&gt;]]]</p>
<blockquote>
<p>Linewrap the output by wrapping each line at <strong>width</strong>. The first line of
each entry is indented by <strong>indent1</strong> spaces, and the second and
subsequent lines are indented by <strong>indent2</strong> spaces. <strong>width</strong>, <strong>indent1</strong>,
and <strong>indent2</strong> default to 76, 6 and 9 respectively.</p>
<p>
If width is <strong>0</strong> (zero) then indent the lines of the output without
wrapping them.</p>
</blockquote>
<p>
&lt;revision-range&gt;</p>
<blockquote>
<p>Show only commits in the specified revision range. When no
&lt;revision-range&gt; is specified, it defaults to <strong>HEAD</strong> (i.e. the whole
history leading to the current commit). <strong>origin..HEAD</strong> specifies all the
commits reachable from the current commit (i.e. <strong>HEAD</strong>), but not from
<strong>origin</strong>. For a complete list of ways to spell &lt;revision-range&gt;, see the
&#34;Specifying Ranges&#34; section of *gitrevisions*(7).</p>
</blockquote>
<p>
[–] &lt;path&gt;…</p>
<blockquote>
<p>Consider only commits that are enough to explain how the files that
match the specified paths came to be.</p>
<p>
Paths may need to be prefixed with <strong>–</strong> to separate them from options or
the revision range, when confusion arises.</p>
</blockquote>
